#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <stdlib.h>
#define N 5

//1、5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//	for (a = 1; a <= 5; a++)   //每个人都有可能是第一名到第五名
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						if ((b == 2 && a !=3) || (b != 2 && a == 3)) //此处用或，因为每个人的说法只有一半是对的
//						{
//							if ((b == 2 && e != 4) || (b != 2 && e == 4))
//							{
//								if ((c == 1 && d != 2) || (c != 1 && d == 2))
//								{
//									if ((c == 5 && d != 3) || (c != 5 && d == 3))
//									{
//										if ((e == 4 && a != 1) || (e != 4 && a == 1))
//										{
//											if (a != b && a != c && a != d && a != e &&
//												b != c && b != d && b != e &&
//												c != d && c != e &&
//												d != e)
//											{
//												printf("A=%d B=%d C=%d D=%d E=%d\n",a,b,c,d,e);
//											}
//										}
//									}
//								}
//							}
//						}
//					}
//				}
//			}
//		}
//	}
//	system("pause");
//	return 0;
//}
//****************************************************************************************
//2.日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
//嫌疑犯的一个。以下为4个嫌疑犯的供词。
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手。
//int main()
//{
//	char killer ;
//	for (killer = 'A'; killer <= 'D'; killer++)  //从A开始遍历凶手
//	{
//		if ((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D') == 3)  //如果说的对，则为1，不对则为0
//		{
//			printf("凶手为：%c\n", killer);  //符合以上条件的为凶手
//		}
//	}
//	system("pause");
//	return 0;
//}
//****************************************************************************************
//3.在屏幕上打印杨辉三角。
//    1
//   1 1
//  1 2 1
// 1 3 3 1
//1 4 6 4 1
int main()
{
	int i = 0;
	int j = 0;
	int arr[N][N] = {0};
	for (i = 0; i < N; i++)  //把每一行的第一个和最后一个数字变为1
	{
		arr[i][0] = 1;
		arr[i][i] = 1;
	}
	for (i = 2; i < N; i++)
	{
		for (j = 1; j < i; j++)
		{
			arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];

		}
	}
	for (i = 0; i < N; i++)
	{
		for (j = 0; j <  2 * (N - i); j++)
		{
			printf(" ");
		}
		for (j = 0; j <= i; j++)
		{
			printf("%4d",arr[i][j]);
		}
		printf("\n");
	}
	system("pause");
	return 0;
}